IO类和unique_ptr都只支持移动而不支持拷贝
------------------
右值引用用于const对象，左值引用用于非const对象，两者它行他就不行；
而const左值引用是个例外，用于const对象
int i=42;
int &r=i;

int &&rr=i;  //xxx
int &&rr=42; //对
---------------------------
move函数左值转右值
int &&rr3=std::move(rr1);

class A
{
  public:
    A()=default;
    A(const A&);
};
A x;
A y(x);
A z(std::move(x));  //左值引用转右值引用转const A&
----------------------------
你把那5个函数都定义准没错。。。别管什么它会合成它会不会了
---------------------------
一个表达式要么左值，要么右值，就是const对象比较特殊，其实是右值，但是可以被const&关联
--------------------------
string s1="123",s2="456";
s1+s2="wow";     //居然没错
所以防止这种错误就是在=运算符重载 后面加个引用限定符&，说明=只能让左值用：
A &opearator=(const A&other) &;

A& retA();    //返回一个左值；
A retVal();   //返回一个右值，临时变量
retA()=j;  //正确
retVal()=j;  //xxx,=只能用于左值


